Repository: quocanh5301/foodie_ui
Catalog: lib/l10n/intl_*.arb
Languages: vi

# intro
source: We are the largest community sharing cooking recipes in Vietnam
vi: Chúng tôi là cộng đồng chia sẻ công thức nấu ăn lớn nhất Việt Nam

source: Login
vi: Đăng nhập

# emailEmpty
source: Email must not be empty
vi: Email không được để trống

# emailFormatError
source: Email is not valid
vi: Email không hợp lệ

source: Password
vi: Mật khẩu

# passwordHint
source: Password
vi: Mật khẩu

# passwordEmpty
source: Password must not be empty
vi: Mật khẩu không được để trống

source: Register
vi: Đăng ký

# registerText1
source: Don't have an account?
vi: Bạn chưa có tài khoản?

# registerText2
source: Create one
vi: Tạo một

# registerTitle1
source: Create Account
vi: Tạo tài khoản

# registerTitle2
source: Explore new recipes with us today !!!
vi: Khám phá công thức mới với chúng tôi ngay hôm nay !!!

source: Forgot Password?
vi: Quên mật khẩu?

# forgotPasswordSuccess
source: Please check your email to reset your password
vi: Hãy kiểm tra email của bạn để đặt lại mật khẩu

# registerSuccess
source: Registration successful. Please check your email to confirm your account
vi: Đăng ký thành công. Vui lòng kiểm tra email của bạn để xác nhận tài khoản

# loginText1
source: Already have an account?
vi: Bạn đã có tài khoản?

# loginText2
source: Log in
vi: Đăng nhập

source: Name
vi: Tên

# nameHint
source: Enter your Name
vi: Nhập tên của bạn

# nameError
source: Please fill in your name
vi: Vui lòng điền tên

# searchAll
source: Search
vi: Tìm kiếm

# explore
source: What would you like to cook today?
vi: Bạn muốn nấu gì hôm nay?

# homeExplore
source: Explore
vi: Khám phá

# homeCreateRecipe
source: Create Recipe
vi: Tạo công thức

# homeBookmarkRecipe
source: Bookmark
vi: Đánh dấu

# homeProfile
source: Profile
vi: Hồ sơ

# recipeNewFollow
source: New Recipe From Your Followed User
vi: Công thức mới từ người dùng bạn theo dõi

# recipeNewFollowNo
source: No new recipe from your followed user
vi: Không có công thức mới từ người dùng bạn theo dõi

# recipeNew
source: New Recipe
vi: Công thức mới

source: Top Recipe
vi: Công thức hàng đầu

# addRecipe
source: Add New Recipe
vi: Thêm công thức mới

# recipeLableField
source: Recipe Name
vi: Tên công thức

# recipeHintField
source: Recipe Name
vi: Tên công thức

# recipeErrorField
source: Recipe Name must not empty
vi: Tên công thức không được để trống

# recipeDescriptionLabel
source: Recipe Description
vi: Mô tả công thức

# recipeDescriptionHint
source: Recipe Description
vi: Mô tả công thức

# recipeInstuctionLabel
source: Recipe Instruction
vi: Hướng dẫn công thức

# recipeInstuctionHint
source: Recipe Instruction
vi: Hướng dẫn công thức

# ingredientLabel
source: Ingredient
vi: Nguyên liệu

# ingredientHint
source: Ingredient
vi: Nguyên liệu

# ingredientError
source: Ingredient must not empty
vi: Nguyên liệu không được để trống

# quantityLabel
source: Quantity
vi: Số lượng

# quantityHint
source: Quantity
vi: Số lượng

# quantityError
source: Quantity must not empty
vi: Số lượng không được để trống

# addIngredientButton
source: Add Ingredient
vi: Thêm nguyên liệu

source: Create New Recipe !!!
vi: Tạo công thức mới !!!

# removePhotoButton
source: 'Remove Photo'
vi: 'Xóa ảnh'

# addPhotoButton
source: Add Photo
vi: Thêm ảnh

# chooseAnotherPhotoButton
source: Choose Another Photo
vi: Chọn ảnh khác

source: Gallery
vi: Thư viện ảnh

# bookmarkTab
source: Your Bookmark Recipe
vi: Công thức bạn đã đánh dấu

source: No Bookmark Recipe Found
vi: Không tìm thấy công thức đã đánh dấu

# allFilter
source: All
vi: Tất cả

# ratingFilter
source: Rating
vi: Đánh giá

# commentsFilter
source: Comments
vi: Bình luận

# bookmarkNumFilter
source: Bookmark
vi: Đã đánh dấu

source: No Name Recipe
vi: Không có công thức nào

source: No Name User
vi: Không có tên người dùng

# noReviewText
source: No Review
vi: Không có bình luận

# yourRecipeTab
source: Your recipes
vi: Công thức của bạn

# yourReviews
source: Reviews
vi: Đánh giá cho bạn

# emptyRecipe
source: No Recipe Found
vi: Không tìm thấy công thức

# emptyReview
source: No Review Found
vi: Không tìm thấy bình luận

source: Your Profile
vi: Hồ sơ của bạn

# noEmail
source: User don't have an Email
vi: Người dùng không có email

# noDescription
source: User don't have a Description
vi: Người dùng không có mô tả

source: Author
vi: Tác giả

source: Join Since
vi: Tham gia từ

source: Update At
vi: Cập nhật lúc

# numOfFollower
source: Follwers
vi: Người theo dõi

source: Empty
vi: Trống

source: No Description Author
vi: Không có mô tả cho tác giả

source: No Description Recipe
vi: Không có mô tả cho công thức

# numOfIngredients
source: Ingredients
vi: Số lượng nguyên liệu

source: Detail
vi: Chi tiết

# review
source: Reviews
vi: Đánh giá

# comment
source: Comments
vi: Bình luận

# recipeInfo
source: Recipe Infomation
vi: Thông tin công thức

# recipe
source: Recipe Detail
vi: Chi tiết công thức

# emptyIngrdients
source: Empty Ingredient
vi: Không có nguyên liệu

source: No Ingredient Name
vi: Không có tên nguyên liệu

# noIngredientAmount
source: No Ingredient Amount Specified
vi: Không có số lượng nguyên liệu

# noInstructionRecipe
source: This recipe has no instruction !
vi: Công thức này không có hướng dẫn!

# rateThisRecipe
source: Rate For This Recipe
vi: Đánh giá công thức này

source: Confirm
vi: Xác nhận

source: Cancel
vi: Hủy

# writeReview
source: Write a review for this recipe
vi: Viết bình luận cho công thức này

# enterReview
source: Enter your review here...
vi: Nhập bình luận của bạn ở đây...

# rateRecipe
source: Rate this recipe
vi: Đánh giá công thức này

source: YOUR REVIEW
vi: BÌNH LUẬN CỦA BẠN

source: Edit Profile
vi: Chỉnh sửa hồ sơ

# notification
source: Notifications
vi: Thông báo

source: Language
vi: Ngôn ngữ

# lang
source: English
vi: Tiếng Việt

source: Logout
vi: Đăng xuất

source: Change Password
vi: Thay đổi mật khẩu

source: Edit Profile
vi: Thay đổi thông tin cá nhân

source: SUBMIT
vi: GỬI

# userDescription
source: Description
vi: Mô tả

# emptyUserDescription
source: User has no description
vi: Người dùng không có mô tả

source: Old Password
vi: Mật khẩu cũ

# oldPasswordHint
source: Enter Your Old Password
vi: Nhập mật khẩu cũ của bạn

# oldPasswordEmpty
source: Old Password must not be empty
vi: Mật khẩu cũ không được để trống

source: New Password
vi: Mật khẩu mới

# newPasswordHint
source: Enter Your New Password
vi: Nhập mật khẩu mới của bạn

# newPasswordEmpty
source: Old Password must not be empty
vi: Mật khẩu mới không được để trống

source: Confirm New Password
vi: Xác nhận mật khẩu mới

# confirmNewPasswordHint
source: Enter Your New Password Again
vi: Nhập lại mật khẩu mới của bạn

# confirmNewPasswordEmpty
source: Confirmation Password must not be empty
vi: Xác nhận mật khẩu không được để trống

# editPassword
source: Edit your password
vi: Chỉnh sửa mật khẩu của bạn

# logoutDialogTitle
source: Logging Out
vi: Đăng xuất

# logoutDialogContent
source: Are you sure you want to log out of this account?
vi: Bạn có chắc chắn muốn đăng xuất khỏi tài khoản này?

source: User Profile
vi: Hồ sơ người dùng

source: Follow
vi: Theo dõi

source: Following
vi: Đang theo dõi

source: Follower
vi: Người theo dõi

# recipeProfile
source: Recipe
vi: Công thức

# searchResult
source: Search Result For
vi: Kết quả tìm kiếm cho

# noUserMatchSearch
source: No User Found
vi: Không tìm thấy người dùng

# noRecipeMatchSearch
source: No Recipe Found
vi: Không tìm thấy công thức

source: User
vi: Người dùng

# dialogDeleteEdit
source: Delete or Edit
vi: Xóa hoặc Chỉnh sửa

# deleteRecipe
source: Delete this recipe
vi: Xóa công thức này

# editRecipe
source: Edit this recipe
vi: Chỉnh sửa công thức này

# deletingRecipeTitle
source: Deleting recipe
vi: Đang xóa công thức

# deletingRecipeContent
source: Do you sure you want to delete this recipe?
vi: Bạn có chắc chắn muốn xóa công thức này không?

# editRecipeButton
source: Edit recipe
vi: Chỉnh sửa công thức

# noNotificationFound
source: No new notification
vi: Không có thông báo mới
